In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
df_train = pd.read_csv("/home/manish/manish/av_hackathon/loan_prediction/dataset/train_ctrUa4K .csv")

In [15]:
df_train.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status,status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y,1
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N,0
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y,1
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y,1
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y,1

In [5]:
df_train.isnull().sum()

Loan_ID               0
Gender               13
Married               3
Dependents           15
Education             0
Self_Employed        32
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           22
Loan_Amount_Term     14
Credit_History       50
Property_Area         0
Loan_Status           0
dtype: int64

In [7]:
df_train['Gender'].value_counts()

Male      489
Female    112
Name: Gender, dtype: int64

In [14]:
df_train.loc[:, 'status'] = df_train['Loan_Status'].apply(lambda x: 0 if x == 'N' else 1)

In [19]:
df_train.groupby(by='Gender').agg({'status': 'mean'})

          status
Gender
Female  0.669643
Male    0.693252

In [24]:
df_train.groupby(by='Self_Employed').agg({'status': 'mean'})

                 status
Self_Employed
No             0.686000
Yes            0.682927

In [25]:
df_train.groupby(by='Loan_Status').agg({'ApplicantIncome': 'mean'})

             ApplicantIncome
Loan_Status
N                5446.078125
Y                5384.068720

In [31]:
df_train.groupby(by=['Loan_Status', 'Dependents']).agg({'CoapplicantIncome': 'mean'})

                        CoapplicantIncome
Loan_Status Dependents
N           0                 1596.943925
            1                 1832.972222
            2                 1599.040000
            3+                4290.111111
Y           0                 1635.723193
            1                 1204.378788
            2                 1716.260526
            3+                 788.424242

In [32]:
df_train.groupby(by='Loan_Status').agg({'Credit_History': 'mean'})

             Credit_History
Loan_Status
N                  0.541899
Y                  0.981818